0/fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kValue 0.4537500000000001;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kValue;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.005;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform $kValue;
    }
	"blade.*"
    {
        type            kqRWallFunction;
        value           uniform $kValue;
    }
	hub
    {
        type            kqRWallFunction;
        value           uniform $kValue;
    }
}


// ************************************************************************* //
