0/fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
CmuValue 0.09;
kappaValue 0.41;
EValue 9.8;
valueValue 0;

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            nutWallFunction;
        value           uniform $valueValue;
    }
	"blade.*"
    {
        type            nutWallFunction;
        value           uniform $valueValue;
    }
	hub
    {
        type            nutWallFunction;
        value           uniform $valueValue;
    }
}


// ************************************************************************* //
