0/fluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
valueValue 0.029281842562497246;
		
dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $valueValue;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $valueValue;
    }
    top
    {
        type            omegaWallFunction;
        value           uniform $valueValue;
    }
	"blade.*"
    {
        type            omegaWallFunction;
        value           uniform $valueValue;
    }
	hub
    {
        type            omegaWallFunction;
        value           uniform $valueValue;
    }
}


// ************************************************************************* //
