constant/fluid/polyMesh/blockMeshDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

od 15; // outlet
id -5; // inlet

vertices
(
	( 1 	-0.5	-0.5) // 0
	( 1 	 0.5	-0.5) // 1
	(-1 	 0.5	-0.5) // 2
	(-1 	-0.5	-0.5) // 3
	
	( 1 	-0.5	 0.5) // 4
	( 1 	 0.5	 0.5) // 5
	(-1 	 0.5	 0.5) // 6
	(-1 	-0.5	 0.5) // 7
	
	
	( 1		 $od		-0.5) // 8
	(-1		 $od		-0.5) // 9
	
	( 1		 $od		 0.5) // 10
	(-1		 $od		 0.5) // 11
	
	( 1		 0.5	 5.0289) // 12
	(-1		 0.5	 5.0289) // 13
	( 1		 $od		 5.0289) // 14
	(-1		 $od		 5.0289) // 15
	
	( 1		 0.5	 -5.0289) // 16
	(-1		 0.5	 -5.0289) // 17
	( 1		 $od		 -5.0289) // 18
	(-1		 $od		 -5.0289) // 19
	
	( 1		 $id		-0.5) // 20
	(-1		 $id		-0.5) // 21
	( 1		 $id		 0.5) // 22
	(-1		 $id		 0.5) // 23
	
	( 1		 $id		5.0289) // 24
	( 1		-0.5	5.0289) // 25
	(-1		-0.5	5.0289) // 26
	(-1		 $id		5.0289) // 27
	
	( 1		 $id		-5.0289) // 28
	( 1		-0.5	-5.0289) // 29
	(-1		-0.5	-5.0289) // 30
	(-1		 $id		-5.0289) // 31
	
	(-5.0289	 0.5	 0.5) // 32
	(-5.0289	-0.5	 0.5) // 33

	(-5.0289	 0.5	 5.0289) // 34
	(-5.0289	-0.5	 5.0289) // 35
	
	(-5.0289	 0.5	 -0.5) // 36
	(-5.0289	-0.5	 -0.5) // 37
	
	(-5.0289	 0.5	 -5.0289) // 38
	(-5.0289	-0.5	 -5.0289) // 39
	
	( 5.0289	-0.5	 -5.0289) // 40
	( 5.0289	 0.5	 -5.0289) // 41
	  
	( 5.0289	-0.5	 -0.5) // 42
	( 5.0289	 0.5	 -0.5) // 43
	  
	( 5.0289	-0.5	  0.5) // 44
	( 5.0289	 0.5	  0.5) // 45
	  
	( 5.0289	-0.5	  5.0289) // 46
	( 5.0289	 0.5	  5.0289) // 47
	
	(-5.0289	$od		  -5.0289) // 48
	(-5.0289	$od		  -0.5) // 49
	(-5.0289	$od		   0.5) // 50
	(-5.0289	$od		   5.0289) // 51
	
	( 5.0289	$od		  -5.0289) // 52
	( 5.0289	$od		  -0.5) // 53
	( 5.0289	$od		   0.5) // 54
	( 5.0289	$od		   5.0289) // 55
	
	(-5.0289	 $id		  -5.0289) // 56
	(-5.0289	 $id		  -0.5) // 57
	(-5.0289	 $id		   0.5) // 58
	(-5.0289	 $id		   5.0289) // 59
	
	( 5.0289	 $id		  -5.0289) // 60
	( 5.0289	 $id		  -0.5) // 61
	( 5.0289	 $id		   0.5) // 62
	( 5.0289	 $id		   5.0289) // 63
	
	(-1 		 $od		 9.94987) // 64
	( 1 		 $od		 9.94987) // 65
	( 7.07107	 $od		 7.07107) // 66
	( 9.98749	 $od	 	 0.5) // 67
	( 9.98749	 $od	 	-0.5) // 68
	( 7.07107	 $od		-7.07107) // 69
	( 1 		 $od		-9.94987) // 70
	(-1 		 $od		-9.94987) // 71
	(-7.07107	 $od		-7.07107) // 72
	(-9.98749	 $od	 	-0.5) // 73
	(-9.98749	 $od	 	 0.5) // 74
	(-7.07107	 $od		 7.07107) // 75
	
	(-1 		 0.5		 9.94987) // 76
	( 1 		 0.5		 9.94987) // 77
	( 7.07107	 0.5		 7.07107) // 78
	( 9.98749	 0.5	 	 0.5) // 79
	( 9.98749	 0.5	 	-0.5) // 80
	( 7.07107	 0.5		-7.07107) // 81
	( 1 		 0.5		-9.94987) // 82
	(-1 		 0.5		-9.94987) // 83
	(-7.07107	 0.5		-7.07107) // 84
	(-9.98749	 0.5	 	-0.5) // 85
	(-9.98749	 0.5	 	 0.5) // 86
	(-7.07107	 0.5		 7.07107) // 87
	
	(-1 		 -0.5		 9.94987) // 88
	( 1 		 -0.5		 9.94987) // 89
	( 7.07107	 -0.5		 7.07107) // 90
	( 9.98749	 -0.5	 	 0.5) // 91
	( 9.98749	 -0.5	 	-0.5) // 92
	( 7.07107	 -0.5		-7.07107) // 93
	( 1 		 -0.5		-9.94987) // 94
	(-1 		 -0.5		-9.94987) // 95
	(-7.07107	 -0.5		-7.07107) // 96
	(-9.98749	 -0.5	 	-0.5) // 97
	(-9.98749	 -0.5	 	 0.5) // 98
	(-7.07107	 -0.5		 7.07107) // 99
	
	(-1 		  $id		 9.94987) // 100
	( 1 		  $id		 9.94987) // 101
	( 7.07107	  $id		 7.07107) // 102
	( 9.98749	  $id	 	 0.5) // 103
	( 9.98749	  $id	 	-0.5) // 104
	( 7.07107	  $id		-7.07107) // 105
	( 1 		  $id		-9.94987) // 106
	(-1 		  $id		-9.94987) // 107
	(-7.07107	  $id		-7.07107) // 108
	(-9.98749	  $id	 	-0.5) // 109
	(-9.98749	  $id	 	 0.5) // 110
	(-7.07107	  $id		 7.07107) // 111
);

M_X_0	6; //20
M_Y_M	3; //10
M_Z_0	3; //10

M_X_1	9;
M_Y_F	30;
M_Y_B	12;
M_Z_1	12;
M_Z_2   9;

blocks
(
// Middle
	// front
	hex (1 8 9 2 5 10 11 6) rotatingZone 		($M_Y_F $M_X_0 $M_Z_0) simpleGrading (1 1 1)
	hex (5 10 11 6 12 14 15 13) rotatingZone 	($M_Y_F $M_X_0 $M_Z_1) simpleGrading (1 1 1)
	hex (16 18 19 17 1 8 9 2) rotatingZone 		($M_Y_F $M_X_0 $M_Z_1) simpleGrading (1 1 1)
	// back
	hex (20 0 3 21 22 4 7 23) rotatingZone 		($M_Y_B $M_X_0 $M_Z_0) simpleGrading (1 1 1)
	hex (22 4 7 23 24 25 26 27) rotatingZone 	($M_Y_B $M_X_0 $M_Z_1) simpleGrading (1 1 1)
	hex (28 29 30 31 20 0 3 21) rotatingZone 	($M_Y_B $M_X_0 $M_Z_1) simpleGrading (1 1 1)
// Right
	// between
	hex (7 6 32 33 26 13 34 35) rotatingZone 	($M_Y_M $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	hex (3 2 36 37 7 6 32 33) rotatingZone 		($M_Y_M $M_X_1 $M_Z_0) simpleGrading (1 1 1)
	hex (30 17 38 39 3 2 36 37) rotatingZone 	($M_Y_M $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	// front
	hex (2 9 49 36 6 11 50 32) rotatingZone 	($M_Y_F $M_X_1 $M_Z_0) simpleGrading (1 1 1)
	hex (17 19 48 38 2 9 49 36) rotatingZone 	($M_Y_F $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	hex (6 11 50 32 13 15 51 34) rotatingZone 	($M_Y_F $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	// back
	hex (21 3 37 57 23 7 33 58) rotatingZone 	($M_Y_B $M_X_1 $M_Z_0) simpleGrading (1 1 1)
	hex (31 30 39 56 21 3 37 57) rotatingZone 	($M_Y_B $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	hex (23 7 33 58 27 26 35 59) rotatingZone 	($M_Y_B $M_X_1 $M_Z_1) simpleGrading (1 1 1)
// Left
	// between
	hex (1 0 42 43 5 4 44 45) rotatingZone 		($M_Y_M $M_X_1 $M_Z_0) simpleGrading (1 1 1)
	hex (16 29 40 41 1 0 42 43) rotatingZone 	($M_Y_M $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	hex (5 4 44 45 12 25 46 47) rotatingZone 	($M_Y_M $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	// front
	hex (8 1 43 53 10 5 45 54) rotatingZone 	($M_Y_F $M_X_1 $M_Z_0) simpleGrading (1 1 1)
	hex (18 16 41 52 8 1 43 53) rotatingZone 	($M_Y_F $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	hex (10 5 45 54 14 12 47 55) rotatingZone 	($M_Y_F $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	// back
	hex (0 20 61 42 4 22 62 44) rotatingZone 	($M_Y_B $M_X_1 $M_Z_0) simpleGrading (1 1 1)
	hex (29 28 60 40 0 20 61 42) rotatingZone 	($M_Y_B $M_X_1 $M_Z_1) simpleGrading (1 1 1)
	hex (4 22 62 44 25 24 63 46) rotatingZone 	($M_Y_B $M_X_1 $M_Z_1) simpleGrading (1 1 1)
// Outer
	// mid
	hex (26 25 12 13 88 89 77 76) rotatingZone 	($M_X_0 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (35 26 13 34 99 88 76 87) rotatingZone 	($M_X_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (33 35 34 32 98 99 87 86) rotatingZone 	($M_Z_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (37 33 32 36 97 98 86 85) rotatingZone 	($M_Z_0 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (39 37 36 38 96 97 85 84) rotatingZone 	($M_Z_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (30 39 38 17 95 96 84 83) rotatingZone 	($M_X_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (95 94 82 83 30 29 16 17) rotatingZone 	($M_X_0 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (40 29 16 41 93 94 82 81) rotatingZone 	($M_X_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (42 40 41 43 92 93 81 80) rotatingZone 	($M_Z_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (44 42 43 45 91 92 80 79) rotatingZone 	($M_Z_0 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (46 44 45 47 90 91 79 78) rotatingZone 	($M_Z_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	hex (25 46 47 12 89 90 78 77) rotatingZone 	($M_X_1 $M_Y_M $M_Z_2) simpleGrading (1 1 1)
	// front
	hex (13 12 14 15 76 77 65 64) rotatingZone 	($M_X_0 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (34 13 15 51 87 76 64 75) rotatingZone 	($M_X_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (32 34 51 50 86 87 75 74) rotatingZone 	($M_Z_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (36 32 50 49 85 86 74 73) rotatingZone 	($M_Z_0 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (38 36 49 48 84 85 73 72) rotatingZone 	($M_Z_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (17 38 48 19 83 84 72 71) rotatingZone 	($M_X_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (16 17 19 18 82 83 71 70) rotatingZone 	($M_X_0 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (41 16 18 52 81 82 70 69) rotatingZone 	($M_X_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (43 41 52 53 80 81 69 68) rotatingZone 	($M_Z_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (45 43 53 54 79 80 68 67) rotatingZone 	($M_Z_0 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (47 45 54 55 78 79 67 66) rotatingZone 	($M_Z_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	hex (12 47 55 14 77 78 66 65) rotatingZone 	($M_X_1 $M_Y_F $M_Z_2) simpleGrading (1 1 1)
	// back
	hex (27 24 25 26 100 101 89 88) rotatingZone 	($M_X_0 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (59 27 26 35 111 100 88 99) rotatingZone 	($M_X_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (58 59 35 33 110 111 99 98) rotatingZone 	($M_Z_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (57 58 33 37 109 110 98 97) rotatingZone 	($M_Z_0 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (56 57 37 39 108 109 97 96) rotatingZone 	($M_Z_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (31 56 39 30 107 108 96 95) rotatingZone 	($M_X_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (28 31 30 29 106 107 95 94) rotatingZone 	($M_X_0 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (60 28 29 40 105 106 94 93) rotatingZone 	($M_X_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (61 60 40 42 104 105 93 92) rotatingZone 	($M_Z_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (62 61 42 44 103 104 92 91) rotatingZone 	($M_Z_0 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (63 62 44 46 102 103 91 90) rotatingZone 	($M_Z_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
	hex (24 63 46 25 101 102 90 89) rotatingZone 	($M_X_1 $M_Y_B $M_Z_2) simpleGrading (1 1 1)
);

edges
(
// front
arc 64 65 (0 $od 10)

arc 75 64 (0 $od 10)
arc 74 75 (0 $od 10)
arc 73 74 (0 $od 10)
arc 72 73 (0 $od 10)
arc 71 72 (0 $od 10)

arc 70 71 (0 $od -10)

arc 70 69 (0 $od 10)
arc 69 68 (0 $od 10)
arc 68 67 (0 $od 10)
arc 67 66 (0 $od 10)
arc 66 65 (0 $od 10)

// mid_1
arc 76 77 (0 0.5 10)

arc 87 76 (0 0.5 10)
arc 86 87 (0 0.5 10)
arc 85 86 (0 0.5 10)
arc 84 85 (0 0.5 10)
arc 83 84 (0 0.5 10)

arc 82 83 (0 0.5 -10)

arc 82 81 (0 0.5 10)
arc 81 80 (0 0.5 10)
arc 80 79 (0 0.5 10)
arc 79 78 (0 0.5 10)
arc 78 77 (0 0.5 10)

// mid_2
arc 88 89 (0 -0.5 10)

arc 99 88 (0 -0.5 10)
arc 98 99 (0 -0.5 10)
arc 97 98 (0 -0.5 10)
arc 96 97 (0 -0.5 10)
arc 95 96 (0 -0.5 10)

arc 94 95 (0 -0.5 -10)

arc 94 93 (0 -0.5 10)
arc 93 92 (0 -0.5 10)
arc 92 91 (0 -0.5 10)
arc 91 90 (0 -0.5 10)
arc 90 89 (0 -0.5 10)

// back
arc 100 101 (0  $id 10)

arc 111 100 (0  $id 10)
arc 110 111 (0  $id 10)
arc 109 110 (0  $id 10)
arc 108 109 (0  $id 10)
arc 107 108 (0  $id 10)

arc 106 107 (0  $id -10)

arc 106 105 (0  $id 10)
arc 105 104 (0  $id 10)
arc 104 103 (0  $id 10)
arc 103 102 (0  $id 10)
arc 102 101 (0  $id 10)
);

boundary
(
	outlet
	{
		type patch;
		faces
		(
			(8 9 11 10)
			(9 8 18 19)
			(15 14 10 11)
			(50 51 15 11)
			(11 9 49 50)
			(8 10 54 53)
			(10 14 55 54)
			(18 8 53 52)
			(48 49 9 19)
			(14 15 64 65)
			(15 51 75 64)
			(51 50 74 75)
			(50 49 73 74)
			(49 48 72 73)
			(48 19 71 72)
			(19 18 70 71)
			(18 52 69 70)
			(52 53 68 69)
			(53 54 67 68)
			(54 55 66 67)
			(55 14 65 66)
		);
		
	}
	inlet
	{
		type patch;
		faces
		(
			(22 23 21 20)
			(61 62 22 20)
			(21 23 58 57)
			(62 63 24 22)
			(22 24 27 23)
			(23 27 59 58)
			(60 61 20 28)
			(28 20 21 31)
			(31 21 57 56)
			(27 24 101 100)
			(24 63 102 101)
			(63 62 103 102)
			(62 61 104 103)
			(61 60 105 104)
			(60 28 106 105)
			(28 31 107 106)
			(31 56 108 107)
			(56 57 109 108)
			(57 58 110 109)
			(58 59 111 110)
			(59 27 100 111)
		);
		
	}
	top
	{
		type wall;
		faces
		(
			(65 64 76 77)
			(77 76 88 89)
			(89 88 100 101)
			(64 75 87 76)
			(76 87 99 88)
			(88 99 111 100)
			(75 74 86 87)
			(87 86 98 99)
			(99 98 110 111)
			(74 73 85 86)
			(86 85 97 98)
			(98 97 109 110)
			(73 72 84 85)
			(85 84 96 97)
			(97 96 108 109)
			(72 71 83 84)
			(83 84 95 96)
			(96 95 107 108)
			(71 70 82 83)
			(83 82 94 95)
			(95 94 106 107)
			(70 69 81 82)
			(82 81 93 94)
			(94 93 105 106)
			(69 68 80 81)
			(81 80 92 93)
			(93 92 104 105)
			(68 67 79 80)
			(80 79 91 92)
			(92 91 103 104)
			(67 66 78 79)
			(79 78 90 91)
			(91 90 102 103)
			(66 65 77 78)
			(78 77 89 90)
			(90 89 101 102)
		);
		
	}
	o_tip_one
	{
		type wall;
		faces
		(
			(13 12 25 26)
		);
		
	}
	o_tip_two
	{
		type wall;
		faces
		(
			(16 17 30 29)
		);
		
	}
	o_left
	{
		type wall;
		faces
		(
			(0 1 16 29)
			(25 12 5 4)
			(1 0 4 5)
		);
	}
	o_right
	{
		type wall;
		faces
		(
			(13 26 7 6)
			(2 3 30 17)
			(2 6 7 3)
		);
	}
	o_back
	{
		type wall;
		faces
		(
			(1 2 17 16)
			(12 13 6 5)
			(1 2 6 5)
		);
	}
	o_front
	{
		type wall;
		faces
		(
			(26 25 4 7)
			(3 0 29 30)
			(3 7 4 0)
		);
	}
);
// ************************************************************************* //