constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    outlet
    {
        type            patch;
        nFaces          1566;
        startFace       1321359;
    }
    inlet
    {
        type            patch;
        nFaces          1566;
        startFace       1322925;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4590;
        startFace       1324491;
    }
    blade_one
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4896;
        startFace       1329081;
    }
    blade_two
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4896;
        startFace       1333977;
    }
    hub
    {
        type            wall;
        inGroups        1(wall);
        nFaces          864;
        startFace       1338873;
    }
    blade_one_tip
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       1339737;
    }
    blade_two_tip
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       1339747;
    }
)

// ************************************************************************* //
