system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.415;// 0.83;

deltaT			0.00001;

writeControl    timeStep;

writeInterval   100;

cycleWrite      0;

writeFormat     ascii;

writeCompression compressed;

timeFormat      general;
writePrecision  10;
timePrecision   10;

runTimeModifiable yes;

adjustTimeStep   off;

functions
(
   pointDisp
   {
       type    solidPointDisplacement;
       point   (0 0 5.05);
   }
//    forces
//    {
//		region fluid;
//        type                forces;
//        functionObjectLibs  ( "libforces.so" );
//        outputControl       timeStep;
//        outputInterval      5;
//        patches             (blade1);
//        pName               p;
//        UName               U;
//        rhoName             rhoInf;
//        log                 true;
//        rhoInf              1.2;
//        CofR                (0 0 0);
//    }
);

// ************************************************************************* //
